EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/Interpret.c
/*
	This file are use for joystick control for SCD Engine

	Copyright BlueBird Aero Systems Ltd 2011
	http://www.bluebird-uav.com

	Revision 1.14  2012/02/21 09:13:50	EranS
	separate MINTRON/SCD project changes
	
*/

#include <stdio.h>
#include <string.h>
#include <stdlib.h>

#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/debug.h"
#include "driverlib/gpio.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "driverlib/timer.h"
#include "utils/uartstdio.h"
#include "driverlib/i2c.h"
#include "driverlib/interrupt.h"
#include "Interpret.h"
#include "comproc.h"
#include "Interpret.h"
#include "modeid.h"
#include "globals.h"
#include "reg.h"
#include "uart_echo.h"
#include "A3906.h"
#include "rmb20d01.h"
#include "encoder.h"

// 3.x for SCD Engine version
 char  *BCVersion  = "Ver:3.9";

#define SENSORS_NUM 				 2u
#define INPUTS_NUM 					 SENSORS_NUM
#define SENSORS_MASK             	 0x0003

#define until(B) {volatile unsigned long long dd=0xffffffff; do{if(!B) break;}while(--dd);}

#define  FOVmin  4.5
#define  FOVmax  48
#define  VERTICAL_PROPORTION_TO_COMMAND 1
#define  HORIZONTAL_PROPORTION_TO_COMMAND 1
#define TXSIZE  20
#define MP_OK 1
#define MP_ERROR -1
#define BEYOND2PIX 4096 / 360

#if 0
//Roll
float A_HOR  = 0.120f;
float B_HOR  = 0.049f;

//Pitch
float A_FAST_VER  = 0.060f;
float B_FAST_VER  = 0.040f;
#else
float A_HOR  = 0.382f;
float B_HOR  = 0.049f;

float A_FAST_VER  = 0.100f;
float B_FAST_VER  = 0.061f;
#endif
float g_fmaximum_ver_rate = 0.100f*23.0f+0.061f;
float g_fmaximum_hor_rate = 0.382f*23.0f+0.049f;

static int opt_zoom = 8;
//*****************************************************************************
//
// The value that is to be modified via bit-banding.
//
//*****************************************************************************
BYTE SensState[INPUTS_NUM] = {0};
BYTE g_sendBuffer[30];

static char Payload_corr=0; // for Mintron

static int DMCflag = 0;
static char g_curentmode = -1;
float  vertical,horizontal;
char Telemetry[16];
//char Payload_type=14;
char Payload_type=7; // For IR Golden
//char Payload_type=8; // for Mintron

extern unsigned short DMCmode;
extern ctrl_type ctrl;
extern BYTE	Stabilize_status;
extern LabelCmd LabelCmdMsg[MAX_LABEL_LENGTH];
extern float omega_vertical,omega_horizontal;  
extern float pitchangle;
extern char  *BCVersion;
extern char  *BBVersion;
extern tBoolean g_tbstabilizer;
extern float Phic,Thetac;
extern tBoolean ignorejoystick;

unsigned int GetDMCflag(unsigned int mask)
{
   return (DMCflag & mask);
}

void SetDMCflag(unsigned int mask, unsigned int val)
{
   DMCflag &= ((~mask) | val);
   DMCflag |= (mask & val); 
}


void ReportData(unsigned long ulBase)
{


	int checksum,i;
	float Roll_Report,Pitch_Report;
	float tmpPhic=0,tmpThetac=0;
	int temp = 0;
	

	Roll_Report = Motor[ROLL_MOTOR].aangle; // (Phic * RAD2DEG);;
	Roll_Report *= BEYOND2PIX;

	Pitch_Report = Motor[PITCH_MOTOR].aangle; // (Thetac* RAD2DEG);	;
	Pitch_Report*=BEYOND2PIX;

		
	g_sendBuffer[0] = 0xb0; //0xb0;
	g_sendBuffer[1] = 0x3b;
	g_sendBuffer[2] = 0x4f;

	g_sendBuffer[3] = 0;//num++ & 0xFF;				//STATUS W0  - TBD by Bluebird
	g_sendBuffer[4] = 0;				// STATUS W1- TBD by Bluebird			// erez    ????
	temp = 0;
	if(!GetDMCflag(DMC_EXE_MODE))
		temp |= 0x1;

	temp |= ((g_curentmode<<2) & 0x7C);

	g_sendBuffer[5] = temp;				// D0: payload is free to accept commands D1: 0- there are no payload fails
	g_sendBuffer[6] = 0;				// R for NUCps	spare	R for AGC ROIps	Iris Reportps

	temp = 0;	
	// D6: 1 == Hot Blk/Wht Rptps	
	if( GetDMCflag(DMC_BLACK_HOT)) 
		temp |= 0x40;

	// D1: 1 == Payload Ready
	if( GetDMCflag(DMC_ENGINE_CONNECT)) // D6: Hot Blk/Wht Rptps
		temp |= 0x02;
	
	g_sendBuffer[7] = ((0x4) | temp); // D1: 1- payload has completed initialization process; D2: 1- camera is using electronic zoom
	
 	if( GetDMCflag(DMC_ZOOM_X2)) 
		g_sendBuffer[8] =  (unsigned char)((38.67f-(23.6f/2))/18.4)*129;
	else
	if( GetDMCflag(DMC_ZOOM_X4)) 
		g_sendBuffer[8] =  (unsigned char)((38.67f-(23.6f/4))/18.4)*129;
	else
		g_sendBuffer[8] =  (unsigned char)((38.67f-23.6f)/18.4)*129;
 	
	g_sendBuffer[9] = ((int)Pitch_Report & 0xFF); // Pitch Report LSB 0-7 Bit
	//Pitch_Report_MSb = ((Pitch_Report >> 8) & 0x0F);
	g_sendBuffer[10] = Payload_type<<4 | (((int)Pitch_Report >> 8) & 0x0F);	
	
 	g_sendBuffer[11] = ((int)Roll_Report & 0xFF); 			// Roll_Report_LSB 0-7 Bit;
	g_sendBuffer[12] = ((int)Roll_Report >> 8) & 0x0F; 			// Roll_Report_LSB 0-3 Bit;

	g_sendBuffer[13] = Payload_corr;

	for (checksum = 0,i=0;i<(18);i++)
		checksum+=g_sendBuffer[i];
	g_sendBuffer[19] = checksum % 256;

	/* write the users command out the serial port */
 	UART0Send(g_sendBuffer, 20);	
 }

void ObservationMode(unsigned char* msg)
{
int cmd;
//unsigned char len=2;	
//float tmpPhic=0,tmpThetac=0;


/*Payload Pitch and Roll  Rate Command to calculate the pixel 
location of the center of the required video image
Pitch (vertical) 0.5 [rad/sec] = 1000 Pixels/Sec
Roll (Horizontal) 1[rad/sec] = 2000 pixels/Sec
For every video frame, Update the center of the FOV by 
these rates multiplied by the command range as defined in Byte 13 & 14:
*/
/*Byte 13
D0-D7	
Vertical rate command in camera coordinate system. 
Together with Byte 8/D0-D1 determines 10 bit unsigned command. 
The payload response to a command in the allowed range of [0..1023] is  
given by:  max_rate*(command-512)/511  
Command of 512 --> 0 rate
Positive command --> line of sight moves upward
In Point Coordinate mode this command moves target position 
data by an offset proportional to command.
In Hold Coordinate mode this command moves holding coordinates 
at a rate proportional to command.
*/
//printf("Interpret - ObservationMode()@%d \n",__LINE__);   //debug
//Roll_Rate = ((Data[7] & 0xF)<<2) +  ((Data[8] & 0xC)>>2);   
//Pitch_Rate = ((Data[8] & 0xF)<<2) +  (Data[11] & 0x3); 

//printf(" 0x%08X 0x%08X\n",*vertical,*horizontal); 

cmd = (int)((int)(msg[16]<<2) + (msg[11] & 0x3));
//vertical = VERTICAL_PROPORTION_TO_COMMAND*(512-cmd)/4;		// Nissim  /511 ; 
vertical = (float)g_fmaximum_ver_rate*((((float)cmd-512.0f)/511.0f));		//Nissim  /511  ;

//horizontal = HORIZONTAL_PROPORTION_TO_COMMAND * (512-cmd)/4;		//Nissim  /511  ;
/*
Byte 14
D0-D7	
Horizontal rate command in camera coordinate system. 
Together with Byte 8/D2-D3 determines 10 bit unsigned command. 
The payload response to a command in the allowed range of [0..1023] is  
given by:  max_rate*(command-512)/511  
Command of 512 --> 0 rate
Positive command --> line of sight moves to the left.
In Point Coordinate mode this command moves target position data by an offset proportional to command.
In Hold Coordinate mode this command moves holding coordinates at a rate proportional to command.
*/
cmd = (int)((int)(msg[17]<<2) + ((msg[11])>>2 & 0x3));
//vertical = VERTICAL_PROPORTION_TO_COMMAND*(512-cmd)/4;		// Nissim  /511 ; 
//horizontal = HORIZONTAL_PROPORTION_TO_COMMAND * (512-cmd)/4;		//Nissim  /511  ;
horizontal = (float)g_fmaximum_hor_rate*(((float)cmd-512.0f)/511.0f);		// Nissim  /511 ; 
}

char PointCoordinateMode(unsigned char* msg)
{
	if(GetDMCmode() == ONLINE_STATE)
	{
	
		if( (!GetDMCflag(DMC_POINT_2_COORD)) || (!GetDMCflag(DMC_EXE_MODE)) )					
		{					
	
