EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/Interpret.c
			SetDMCflag(DMC_POINT_2_COORD,DMC_POINT_2_COORD);							
			SetDMCflag(DMC_CAM_GUIDE | DMC_STOW | DMC_PILOT_WINDOW | DMC_RATE | DMC_PTC_CG,0);								
			
			strcpy(LabelCmdMsg[0].Text,"PTC");
			LabelCmdMsg[0].Text[strlen(LabelCmdMsg[0].Text)] = 0;										
			Set_LABEL_Visibility(OSD_MODE_ID,1);								

			g_tbstabilizer = true;			
			omega_vertical = (Thetac * RAD2DEG);		
			omega_horizontal = (Phic * RAD2DEG);		
											
			ctrl.state[TEXT_LABEL] = HIDE_SHOW_LABEL;													
			SetDMCflag(DMC_EXE_MODE,0);
			putDMCmode(SET_LABEL_COMMAND);
			return POINT_COORDINATE_MODE;
		}													
	}
	return -1;
}


char HoldCoordinateMode(unsigned char* msg)
{
	if(GetDMCmode() == ONLINE_STATE)
	{
		if( (!GetDMCflag(DMC_RATE)) || (!GetDMCflag(DMC_EXE_MODE)) )	
		{	
				SetDMCflag(DMC_RATE,DMC_RATE);						
				SetDMCflag(DMC_STOW | DMC_PILOT_WINDOW | DMC_POINT_2_COORD | DMC_CAM_GUIDE | DMC_PTC_CG ,0);																									
				
				strcpy(LabelCmdMsg[0].Text,"RATE");
				LabelCmdMsg[0].Text[strlen(LabelCmdMsg[0].Text)] = 0;										
				Set_LABEL_Visibility(OSD_MODE_ID,1);
				
				ctrl.state[TEXT_LABEL] = HIDE_SHOW_LABEL;					
				SetDMCflag(DMC_EXE_MODE,0); 						
				
				g_tbstabilizer = true;			
				omega_vertical = (Thetac * RAD2DEG);		
				omega_horizontal = (Phic * RAD2DEG);		
				
				putDMCmode(SET_LABEL_COMMAND);
				return HOLD_COORDINATE_MODE;				
		}
	}

	return -1;
}

char RateMode(unsigned char* msg)
{
	g_tbstabilizer = true;			

	if(GetDMCmode() == ONLINE_STATE)
	{
		if( (!GetDMCflag(DMC_RATE)) || (!GetDMCflag(DMC_EXE_MODE)) )	
		{	
				SetDMCflag(DMC_RATE,DMC_RATE);						
				SetDMCflag(DMC_STOW | DMC_PILOT_WINDOW | DMC_POINT_2_COORD | DMC_CAM_GUIDE | DMC_PTC_CG ,0);																									
				
				strcpy(LabelCmdMsg[0].Text,"RATE");
				LabelCmdMsg[0].Text[strlen(LabelCmdMsg[0].Text)] = 0;										
				Set_LABEL_Visibility(OSD_MODE_ID,1);
				
				ctrl.state[TEXT_LABEL1] = LEBEL_TEXT; 
				Put_Text_Label(OSD_MODE_ID,1);

				SetDMCflag(DMC_EXE_MODE,0);
				
				g_tbstabilizer = true;			
				ignorejoystick = false; 						
				omega_vertical = (Thetac * RAD2DEG);		
				omega_horizontal = (Phic * RAD2DEG);		

				MotorBrakePositionClean(PITCH_MOTOR);
				MotorBrakePositionClean(ROLL_MOTOR);

				//ctrl.state[TEXT_LABEL] = HIDE_SHOW_LABEL;											
				//putDMCmode(SET_LABEL_COMMAND);
				return OBSERVATION_MODE;				
		}
	}

	return -1;
}

char PilotWindowMode(unsigned char* msg)
{

	if(GetDMCmode() == ONLINE_STATE)
	{
		if(!GetDMCflag(DMC_PILOT_WINDOW) || (!GetDMCflag(DMC_EXE_MODE)) )
		{
						
			SetDMCflag(DMC_PILOT_WINDOW,DMC_PILOT_WINDOW);	// signal for control center			
			SetDMCflag(DMC_STOW | DMC_RATE | DMC_POINT_2_COORD | DMC_CAM_GUIDE | DMC_PTC_CG,0); 																

 			strcpy(LabelCmdMsg[OSD_MODE_ID].Text,"PILOT");
			LabelCmdMsg[OSD_MODE_ID].Text[strlen(LabelCmdMsg[OSD_MODE_ID].Text)] = 0;										
			Set_LABEL_Visibility(OSD_MODE_ID,1);

			ctrl.state[TEXT_LABEL1] = LEBEL_TEXT; 
			Put_Text_Label(OSD_MODE_ID,1);

		    SetDMCflag(DMC_EXE_MODE,0);		
			

			ignorejoystick = true;		
			g_tbstabilizer = false;			
			EncoderInit2Point(PITCH_MOTOR,A3906_FORWARD,Motor[PITCH_MOTOR].max_position);		  
			EncoderInit2Point(ROLL_MOTOR,A3906_FORWARD,Motor[ROLL_MOTOR].zero_pos); // SCD Engine encoder 360

	
			//ctrl.state[TEXT_LABEL] = HIDE_SHOW_LABEL; 		
			//SetDMCflag(DMC_EXE_MODE,0);	
			//putDMCmode(SET_LABEL_COMMAND);
			return PILOT_WINDOW_MODE;
 		}		
	}	
	return -1;
}



char StowMode(unsigned char* msg)
{
	if(GetDMCmode() == ONLINE_STATE)
	{
		if(!GetDMCflag(DMC_STOW) || (!GetDMCflag(DMC_EXE_MODE)) )
		{
			SetDMCflag(DMC_STOW,DMC_STOW);		
			SetDMCflag(DMC_PILOT_WINDOW | DMC_RATE | DMC_POINT_2_COORD | DMC_CAM_GUIDE | DMC_PTC_CG,0); // signal for control center		
			
 			strcpy(LabelCmdMsg[0].Text,"SAFE");
			LabelCmdMsg[0].Text[strlen(LabelCmdMsg[0].Text)] = 0;										
			Set_LABEL_Visibility(OSD_MODE_ID,1);

			ctrl.state[TEXT_LABEL1] = LEBEL_TEXT; 
			Put_Text_Label(OSD_MODE_ID,1);
			SetDMCflag(DMC_EXE_MODE,0);	

			ignorejoystick = true;	  
			g_tbstabilizer = false;																
			EncoderInit2Point(PITCH_MOTOR,A3906_FORWARD,1000);		  
			EncoderInit2Point(ROLL_MOTOR,A3906_FORWARD,1000); // SCD Engine encoder 360			

			//ctrl.state[TEXT_LABEL] = HIDE_SHOW_LABEL;					
			//SetDMCflag(DMC_EXE_MODE,0);	
			//putDMCmode(SET_LABEL_COMMAND);
			return STOW_MODE;
 		}
	}
	return -1;
}


void Osd_Show(unsigned char* msg)
{
 	unsigned short cmd;
 	//unsigned short idx = 1;
 	//unsigned short i = 0;
	//int id = 0;

 		cmd = (msg[3] & 0x40);
	
		switch(cmd)
		{

			case 0x0:


					if( GetDMCflag(DMC_OSD_ON) || (!GetDMCflag(DMC_EXE_MODE)) )
					{
						//SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE);						
						SetDMCflag(DMC_OSD_ON,0);
 					}


			break;

			case 0x40:


					if( (!GetDMCflag(DMC_OSD_ON)) || (!GetDMCflag(DMC_EXE_MODE)) )
					{
						//SetDMCflag(DMC_EXE_MODE,DMC_EXE_MODE);
						SetDMCflag(DMC_OSD_ON,DMC_OSD_ON);	
 					}


			break;

		
			default:

			break;
			
			}
}

void CameraCalibMode(unsigned char* msg)
{
	//printf("Interpret - CameraCalibMode()@%d \n",__LINE__);
}

void ScanMode(unsigned char* msg)
{
	//printf("Interpret - ScanMode()@%d \n",__LINE__);
}

void DriftCalibMode(unsigned char* msg)
{
	//printf("Interpret - DriftCalibMode()@%d \n",__LINE__);
}

void ScaleCalibMode(unsigned char* msg)
{
	//printf("Interpret - ScaleCalibMode()@%d \n",__LINE__);
}

void GimbalCalibMode(unsigned char* msg)
{
	//printf("Interpret - GimbalCalibMode()@%d \n",__LINE__);
}

char BitMode(unsigned char* msg)
{
	//printf("Interpret - BitMode()@%d \n",__LINE__);
	return BIT_MODE; 
}

void FlirCalibMode(unsigned char* msg)
{
	//printf("Interpret - FlirCalibMode()@%d \n",__LINE__);
}

void PositionMode(unsigned char* msg)
{
	//printf("Interpret - PositionMode()@%d \n",__LINE__);
}

void VHCalibMode(unsigned char* msg)
{
	//printf("Interpret - VHCalibMode()@%d \n",__LINE__);
}

void TestScanMode(unsigned char* msg)
{
	//printf("Interpret - TestScanMode()@%d \n",__LINE__);
}

