EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/Interpret.c
void GpsNavInitMode(unsigned char* msg)
{
	//printf("Interpret - GpsNavInitMode()@%d \n",__LINE__);
}

void NavInitMode(unsigned char* msg)
{
	//printf("Interpret - NavInitMode()@%d \n",__LINE__);
}

void Mode17Mode(unsigned char* msg)
{
	//printf("Interpret - Mode17Mode()@%d \n",__LINE__);
}

void GyrocompassMode(unsigned char* msg)
{
	//printf("Interpret - GyrocompassMode()@%d \n",__LINE__);
}

void GimbalCheckMode(unsigned char* msg)
{
	//printf("Interpret - GimbalCheckMode()@%d \n",__LINE__);
}

void GyroCalibMode(unsigned char* msg)
{
	//printf("Interpret - GyroCalibMode()@%d \n",__LINE__);
}

void ObstructionTest1Mode(unsigned char* msg)
{
	//printf("Interpret - ObstructionTest1Mode()@%d \n",__LINE__);
}

void ObstructionTest2Mode(unsigned char* msg)
{
	//printf("Interpret - ObstructionTest2Mode()@%d \n",__LINE__);
}

void ObstructionTest3Mode(unsigned char* msg)
{
	//printf("Interpret - ObstructionTest3Mode()@%d \n",__LINE__);
}

void BoresightCalibMode(unsigned char* msg)
{
	//printf("Interpret - BoresightCalibMode()@%d \n",__LINE__);
}

char CenterMode(unsigned char* msg)
{
	if(GetDMCmode() == ONLINE_STATE)
	{
		if(!GetDMCflag(DMC_CENTER_MODE) || (!GetDMCflag(DMC_EXE_MODE)) )
		{
						
			SetDMCflag(DMC_CENTER_MODE,DMC_CENTER_MODE);	// signal for control center			
			SetDMCflag(DMC_STOW | DMC_RATE | DMC_POINT_2_COORD | DMC_CAM_GUIDE | DMC_PTC_CG,0); 																

 			strcpy(LabelCmdMsg[OSD_MODE_ID].Text,"CENTER");
			LabelCmdMsg[OSD_MODE_ID].Text[strlen(LabelCmdMsg[OSD_MODE_ID].Text)] = 0;										
			Set_LABEL_Visibility(OSD_MODE_ID,1);

			ctrl.state[TEXT_LABEL1] = LEBEL_TEXT; 
			Put_Text_Label(OSD_MODE_ID,1);

		    SetDMCflag(DMC_EXE_MODE,0);		
			

			ignorejoystick = true;		
			g_tbstabilizer = false;			
			EncoderInit2Point(PITCH_MOTOR,A3906_FORWARD,Motor[PITCH_MOTOR].zero_pos);		  
			EncoderInit2Point(ROLL_MOTOR,A3906_FORWARD,Motor[ROLL_MOTOR].zero_pos); // SCD Engine encoder 360


			return CENTER_MODE;
 		}		
	}	
	return -1;

}

void ImageFlipMode(unsigned char* msg)
{
	//int ret;
	//ret = ImageFlipVerticall();
	//if (ret==-1)printf("Interpret - ERROR ImageFlipMode()@%d \n",__LINE__);
}

void GimbalZeroMode(unsigned char* msg)
{
	//printf("Interpret - GimbalZeroMode()@%d \n",__LINE__);
}

void RatePositionMode(unsigned char* msg)
{
	//printf("Interpret - RatePositionMode()@%d \n",__LINE__);
}

void Mode29Mode(unsigned char* msg)
{
	//printf("Interpret - Mode29Mode()  @%d \n",__LINE__);
}

void CommlossMode(unsigned char* msg)
{
	//printf("Interpret - CommlossMode()@%d \n",__LINE__);
}

void MaintenanceMode(unsigned char* msg)
{
	//printf("Interpret - MaintenanceMode()@%d \n",__LINE__);
}	


// Interpreting the data of the mode
void InterpretCmdMode(unsigned char *bdData1)
{	
//	printf("Interpret - bdData[3] = 0x%02X   @%d \n",bdData1[3],__LINE__);
//	printf("Interpret - mode = 0x%02X   @%d \n",mode,__LINE__);
	
	char mode = bdData1[3] & 0x0F;

	if(GetDMCflag(DMC_ENGINE_CONNECT))
	{
		if(g_curentmode != mode)
		{
			if ( mode == OBSERVATION_MODE) // 0
				g_curentmode = RateMode(bdData1);
			else if ( mode == HOLD_COORDINATE_MODE) // 2
				g_curentmode = HoldCoordinateMode(bdData1);
			else if ( mode == POINT_COORDINATE_MODE) //1//
				g_curentmode = PointCoordinateMode(bdData1);			
			else if ( mode == PILOT_WINDOW_MODE) //3// 
				g_curentmode = PilotWindowMode(bdData1);
			else if ( mode == STOW_MODE) //4// 
				g_curentmode = StowMode(bdData1);
			else if (mode == CENTER_MODE)
				g_curentmode = CenterMode(bdData1);
			//else if ( mode == BIT_MODE) //10
				//g_curentmode = BitMode(bdData1);
			
		}
		
		ObservationMode(bdData1);
		
		#if 0
		else if ( mode == POINT_COORDINATE_MODE) //1//
			{
				PointCoordinateMode(bdData1);
			}
		else if (mode == HOLD_COORDINATE_MODE) //2//
			{
				HoldCoordinateMode(bdData1);
			}
		else if ( mode == PILOT_WINDOW_MODE) //3// 
			{
				PilotWindowMode(bdData1);
			}
		else if ( mode == STOW_MODE) //4// 
			{
				StowMode(bdData1);
			}
		else if ( mode == CAMERA_CALIB_MODE) //5
			{
				CameraCalibMode(bdData1);
			}
		else if ( mode == SCAN_MODE) //6
			{
				ScanMode(bdData1);
			}
		else if ( mode == DRIFT_CALIB_MODE) //7
			{
				DriftCalibMode(bdData1);
			}
		else if ( mode == SCALE_CALIB_MODE) //8
			{
				ScaleCalibMode(bdData1);
			}
		else if (mode == GIMBAL_CALIB_MODE) //9
			{
				GimbalCalibMode(bdData1);
			}
		else if ( mode == BIT_MODE) //10
			{
				BitMode(bdData1);
			}
		else if ( mode == FLIR_CALIB_MODE) //11
			{
				FlirCalibMode(bdData1);
			}
		else if (mode == POSITION_MODE) //12
			{
				PositionMode(bdData1);	
			}
		else if ( mode == V_H_CALIB_MODE) //13
			{
				VHCalibMode(bdData1);
			}
		else if (mode == TEST_SCAN_MODE) //14 
			{
				TestScanMode(bdData1);
			}
		else if (mode == GPS_NAV_INIT_MODE) //15
			{
				GpsNavInitMode(bdData1);
			}
		else if (mode == NAV_INIT_MODE) //16
			{
				NavInitMode(bdData1);
			}
		else if (  mode == MODE_17_MODE) //17
			{
				Mode17Mode(bdData1);
			}
		else if (  mode == GYROCOMPASS_MODE) //18
			{
				GyrocompassMode(bdData1);
			}
		else if (  mode == GIMBAL_CHECK_MODE) //19
			{
				GimbalCheckMode(bdData1);
			}
		else if (  mode == GYRO_CALIB_MODE) //20
			{
				GyroCalibMode(bdData1);
			}
		else if (  mode == OBSTRUCTION_TEST1_MODE) //21
			{
				ObstructionTest1Mode(bdData1);
			}
		else if (  mode == OBSTRUCTION_TEST2_MODE) //22
			{
				ObstructionTest2Mode(bdData1);
			}
		else if (  mode == OBSTRUCTION_TEST3_MODE) //23
			{
				ObstructionTest3Mode(bdData1);
			}
		else if (  mode == BORESIGHT_CALIB_MODE) //24
			{
				BoresightCalibMode(bdData1);
			}
		else if (  mode == CENTER_MODE) //25
			{
				CenterMode(bdData1);
			}
		else if (  mode == IMAGE_FLIP_MODE) //26
			{
				ImageFlipMode(bdData1);
			}
		else if (  mode == GIMBAL_ZERO_MODE) //27
			{
				GimbalZeroMode(bdData1);
			}
		else if (  mode == RATE_POSITION_MODE) //28
			{
				RatePositionMode(bdData1);
			}
		else if (  mode == MODE_29_MODE) //29
			{
				Mode29Mode(bdData1);
			}
		else if (  mode == COMMLOSS_MODE) //30
			{
				CommlossMode(bdData1);
			}
		else if (  mode == MAINTENANCE_MODE) //31
			{
				MaintenanceMode(bdData1);
			}
		else
			{			
				// ERROR
				//printf("Interpret.h -->   Could not interpret mode  @%d \n",__LINE__);
			}
		#endif
	}
}

void UavLatitude(unsigned char* msg)
{
	unsigned short cmd;
	unsigned short mode;	
	unsigned short idx = 1;
	unsigned short i = 0;
	
	mode = (msg[6] & 0x0F);
		
	for(i=1;i<8;i++)
	{
			
		cmd = (msg[6] & idx);
		
		switch(cmd)
		{

			case 0x01: // ZOOM OUT

				if(cmd)
				{
					if ((WORD)(GetSysTickCount() - ctrl.time[TIME_ZOOM]) >= (WORD)1000) //-- every 1 sec
					{						
				
