EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/Interpret.c
					  if(GetDMCmode() == ONLINE_STATE)
					  {
						if(GetDMCflag(DMC_ZOOM_X4))
						{
							g_fmaximum_ver_rate = A_FAST_VER*18.0f+B_FAST_VER;
							g_fmaximum_hor_rate = A_HOR*18.0f+B_HOR;						
							ctrl.state[TIME_ZOOM2] = Z2_SENT_MESSAGE;																							
							ctrl.time[TIME_ZOOM] = GetSysTickCount();							
							putDMCmode(UPDATE_ZOOMX2);					// ZOOM X2		
						}
						else
						if(GetDMCflag(DMC_ZOOM_X2))
						{
							g_fmaximum_ver_rate = A_FAST_VER*23.0f+B_FAST_VER;
							g_fmaximum_hor_rate = A_HOR*37.0f+B_HOR;
				
							ctrl.state[TIME_DIS] = DIS_SENT_MESSAGE;							
							ctrl.time[TIME_ZOOM] = GetSysTickCount();							
							putDMCmode(UPDATE_DISABLE_ZOOM); 			// ZOOM Out
							
						}
					  }
												
					}		
					
				}

				
			break;

			case 0x02: // ZOOM IN

				if(cmd)
				{
 					if ((WORD)(GetSysTickCount() - ctrl.time[TIME_ZOOM]) >= (WORD)1000) //-- every 3 sec
					{
						if(GetDMCmode() == ONLINE_STATE)
						{						
							if(GetDMCflag(DMC_DISABLE_ZOOM))
							{
								g_fmaximum_ver_rate = A_FAST_VER*18.0f+B_FAST_VER;
								g_fmaximum_hor_rate = A_HOR*18.0f+B_HOR;		
								ctrl.state[TIME_ZOOM2] = Z2_SENT_MESSAGE;																											
								ctrl.time[TIME_ZOOM] = GetSysTickCount();															
								putDMCmode(UPDATE_ZOOMX2);					// ZOOM X2
							
							}
							else
							if(GetDMCflag(DMC_ZOOM_X2) )
							{

								g_fmaximum_ver_rate = A_FAST_VER*14.0f+B_FAST_VER;
								g_fmaximum_hor_rate = A_HOR*14.0f+B_HOR;								
								ctrl.state[TIME_ZOOM4] = Z4_SENT_MESSAGE;																																
								ctrl.time[TIME_ZOOM] = GetSysTickCount();								
								putDMCmode(UPDATE_ZOOMX4);					// ZOOM X4
							}
						}													
					}

 				}


				
			break;
			
			default:

			break;


		}	
	
		idx<<=1;	
	}
}


void UavLongitude(unsigned char* msg)
{
 	unsigned short cmd;
 	unsigned short idx = 1;
 	unsigned short i = 0;
	
 //erez   who MSB        float
//	UAV_longitude = (float)((int)(input_data_com0[15]) + (int)(input_data_com0[14]<<8) + (int)(input_data_com0[13]<<16) + (int)(input_data_com0[12]<<24) );
//	printf("Interpret - UavLongitude = %f \n",UAV_longitude);



		for(i=0;i<8;i++)
		{
		
 		cmd = (msg[5] & idx);
	
		switch(i)
		{

			case 0x6:

				if(GetDMCmode() == ONLINE_STATE)
				{
					if(cmd)
					{				
						//if ((WORD)(GetSysTickCount() - ctrl.time[WHITE_BLACK]) >= (WORD)2000) //-- every 1 sec
						//{

								if((!GetDMCflag(DMC_BLACK_HOT)) || (!GetDMCflag(DMC_EXE_MODE)) )	
								{							
									SetDMCflag(DMC_BLACK_HOT,DMC_BLACK_HOT);  // signal for control center
									SetDMCflag(DMC_WHITE_HOT,0);
									
									SetDMCflag(DMC_EXE_MODE,0);
									ctrl.time[WHITE_BLACK] = GetSysTickCount();
									ctrl.state[TIME_BH] = 0;
									putDMCmode(BLACK_HOT);																			
								}
						//}
						
					}
					else
					{
						//if ((WORD)(GetSysTickCount() - ctrl.time[WHITE_BLACK]) >= (WORD)2000) //-- every 1 sec
						//{
						
								if((!GetDMCflag(DMC_WHITE_HOT)) || (!GetDMCflag(DMC_EXE_MODE)) )		
								{						
									SetDMCflag(DMC_WHITE_HOT,DMC_WHITE_HOT);  // signal for control center
									SetDMCflag(DMC_BLACK_HOT,0);
									
									SetDMCflag(DMC_EXE_MODE,0);
									ctrl.time[WHITE_BLACK] = GetSysTickCount(); 	
									ctrl.state[TIME_WH] = 0;
									putDMCmode(WHITE_HOT);	
								}
						//}

					}
				}
				
			break;

			#if 0
			case 0x1:
			
			
					if(cmd)
					{

						if ((WORD)(GetSysTickCount() - ctrl.time[TIME_STABILIZ]) >= (WORD)1000) //-- every 3 sec
						{					
							if(GetDMCmode() == ONLINE_STATE)
							{					
									
								if(!GetDMCflag(DMC_STABILIZE_ON))
								{
									SetDMCflag(DMC_STABILIZE_ON,DMC_STABILIZE_ON);	// signal for control center
									SetDMCflag(DMC_STABILIZE_OFF,0);
									//Stabilize_status = 0x1;
									ctrl.time[TIME_STABILIZ] = GetSysTickCount();
									//putDMCmode(ON_OFF_STABILIZE);	
									putDMCmode(REFRESH_NUC);	
								}																
								else
								if(!GetDMCflag(DMC_STABILIZE_OFF))
								{
									SetDMCflag(DMC_STABILIZE_OFF,DMC_STABILIZE_OFF);  // signal for control center
									SetDMCflag(DMC_STABILIZE_ON,0);									
									//Stabilize_status = 0x0;
									ctrl.time[TIME_STABILIZ] = GetSysTickCount();
									//putDMCmode(ON_OFF_STABILIZE);
									putDMCmode(REFRESH_NUC);
								}
							}
						}
					}
				
			break;
			#endif
			
			default:

			break;
			
			}
		
			idx<<=1;	
		
		}
}


void	UAV_Altitude_above_MSL(unsigned char* msg)
{
//float UAV_Altitude;
 //erez   who  is MSB        float
//	UAV_Altitude = (int)((msg[12]<<24) & 0xFF000000);
//	printf("Interpret - UAV_Altitude_above_MSL = %02X %f \n",input_data_com0[12],UAV_Altitude);

//	UAV_Altitude = (int)((msg[13]<<16) & 0xFF0000);
//	printf("Interpret - UAV_Altitude_above_MSL = %02X %f \n",input_data_com0[13],UAV_Altitude);

//	UAV_Altitude = (int)((msg[14]<<8) & 0xFF00);
//	printf("Interpret - UAV_Altitude_above_MSL = %02X %f \n",input_data_com0[14],UAV_Altitude);

//	UAV_Altitude = (int)((msg[15]<<8) & 0xFF00);
//	printf("Interpret - UAV_Altitude_above_MSL = %02X %f \n",input_data_com0[15],UAV_Altitude);

//	UAV_Altitude = (float)((int)(msg[15]) + (int)(msg[14]<<8) + (int)(msg[13]<<16) + (int)(msg[12]<<24)) ;

//	printf("Interpret - UAV_Altitude_above_MSL = %08X %f \n",UAV_Altitude,UAV_Altitude);
}

void 	Ground_Height_above_MSL(unsigned char* msg)
{
  	//int cmd;
 	//cmd = (msg[4] & 0x0F);
}


void 	UAV_Body_Azimuth(unsigned char* msg)
{
//int body_azimuth;

	//body_azimuth = (int)((int)(msg[10]<<8) +  msg[9]);

	//printf("Interpret - UAV_Body_Azimuth=%d  \n",body_azimuth);
}

void 	Ground_Speed()
{
	//printf("Interpret - Ground_Speed()@%d \n",__LINE__);
}

void 	Target_Latitude()
{
	//printf("Interpret - Target_Latitude()@%d \n",__LINE__);
}
void Target_Longitude()
{
	//printf("Interpret - Target_Longitude()@%d \n",__LINE__);
}
void 	Target_Altitude_above_MSL(unsigned char* msg)   //8
{
//int trg_alt_MSL ;
//char   tempString[9];
//erez  who MSB ?
	//trg_alt_MSL = (int)((int)(msg[13]<<8) +  msg[12]);
//	printf(" %x %x \n",input_data_com0[10]<<8,input_data_com0[9]);
//	sprintf(tempString, "%d%%", trg_alt_MSL);
//    drawText(tempString, 10, 20); 
	//printf("Interpret - Target_Altitude_above_MSL = %d \n",trg_alt_MSL);

