EranSegal/ek-lm4f230H5QR/BBStabilizedPlatform_IR/Interpret.c
}

void Dial_Address(unsigned char* msg)
{
	 //erez   who MSB		 float
	//	UAV_longitude = (float)((int)(input_data_com0[15]) + (int)(input_data_com0[14]<<8) + (int)(input_data_com0[13]<<16) + (int)(input_data_com0[12]<<24) );
	//	printf("Interpret - UavLongitude = %f \n",UAV_longitude);
		
}

void	Elevation_gimbal_angle()
{
	//printf("Interpret - Elevation_gimbal_angle()@%d \n",__LINE__);
}


void LOS_Roll(void)
{

	float Los_Roll = Phic;//(Phic * RAD2DEG);
	memcpy(&g_sendBuffer[14],&Los_Roll,sizeof(float));
}

void LOS_Pitch(void)
{

	float LOSPitch = Thetac;//(Thetac* RAD2DEG);
	memcpy(&g_sendBuffer[14],&LOSPitch,sizeof(float));

}

// Interpreting the data of the correlator
void InterpretCorrelatorMode(unsigned char *bdData1)
{

	char CheckingCorr = (bdData1[11] & CHECKING_CORR_NUMBER)>>4;


			if(GetDMCflag(DMC_ENGINE_CONNECT))
			{
				UavLatitude(bdData1);
		 		UavLongitude(bdData1);
		 		//Osd_Show(bdData1); 		
			}

			#if 1
			memset(&g_sendBuffer[0],0,20);

			if ( CheckingCorr == UAV_LATITUDE)					// 0
			{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
			}
			else if ( CheckingCorr == UAV_LONGITUDE)			// 1
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == UAV_ALTITUDE_ABOVE_MSL)	// 2
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == GROUND_HEIGHT_ABOVE_MSL)	// 3 
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == UAV_BODY_AZIMUTH) 		// 4
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
					LOS_Roll();
				}
			else if ( CheckingCorr == GROUND_SPEED) 			// 5
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
					LOS_Pitch();
				}
			else if ( CheckingCorr == TARGET_LATITUDE)			//6
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == TARGET_LONGITUDE) 		// 7
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == TARGET_ALTITUDE_ABOVE_MSL) // 8
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == DIAL_ADDRESS) 			//9
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == ELEVATION_GIMBAL_ANGLE)	// 10
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == SPARE11)			//6
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == SPARE12) 		// 7
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == SPARE13) // 8
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == SPARE14) 			//9
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}
			else if ( CheckingCorr == SPARE14)	// 10
				{
					Payload_corr = (CheckingCorr << 4) & 0xF0;
				}	
			#endif

}


void InterpretCmd(void)
{

		InterpretCmdMode(cpGetMessage(COM0));		
		InterpretCorrelatorMode(cpGetMessage(COM0));						
		ReportData(UART0_BASE);
}
